snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусРаботыСотрудника/СтатусРаботыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусРаботыСотрудника</name>
  <comment>Контроль заданий сотрудника</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРаботы</name>
    <type>
      <types>CatalogRef.ВидыДопОбработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыШК/ВидыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыШК</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Дополнительный</name>
  </enumValues>
  <enumValues>
    <name>Временный</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаданиеНабора/ЗаданиеНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНабора</name>
  <basedOn>Document.ПланНабора</basedOn>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПланНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧасти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>String</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданоОбработкойПополнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнаяНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьВПервуюОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйНабор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборМиксами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяФормированиеНабораЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормированиеНаборовЧЗЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗНМ</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>НеконтролироватьСканированиеЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМестоНаборщика</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресноеХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделенная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийЗНБ</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичноСобран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляНаборов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланируемыеСостояния</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/CommonModules/ADRESS/Module.bsl
/////////База НАХ ////////////////////////////

функция ВернутьПроксиНАХ() Экспорт  
	
	//Тимофеев Ю.А. 03.02.2026
	//возвращает прокси подключения
	//к база Наше Адресное Хранение
	
	МойАдрес       =  Справочники.КлючиБезопасногоХранилищаДанных.НайтиПоКоду("000000023");
	ДанныеДоступа  =  РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(МойАдрес);
    
	ЛогинВебСервиса  = ДанныеДоступа.Логин;
	ПарольВебСервиса = ДанныеДоступа.Пароль;  
	АдресВебСервиса  = ДанныеДоступа.Хост; 
	
	Попытка		
		Определения = Новый WSОпределения(АдресВебСервиса,ЛогинВебСервиса,ПарольВебСервиса);
	Исключение
		
		Возврат Неопределено;		
	КонецПопытки;	
	Срвс = Определения.Сервисы.Получить(0);
	Прокси = Новый WSПрокси(Определения, Срвс.URIПространстваИмен, Срвс.Имя, Срвс.Имя + "Soap");
	Прокси.Пользователь	= ЛогинВебСервиса;
	Прокси.Пароль		= ПарольВебСервиса;
		
	Возврат Прокси;
	
КонецФункции   


Функция ЗначениеИзХранилища(ХранилищеЗначений)  Экспорт
		
	Возврат  ХранилищеЗначений.Получить();
	
КонецФункции

Функция ЗначениеВХранилище(Значение)  Экспорт
	
	Хранилище = Новый ХранилищеЗначения(Значение, Новый СжатиеДанных(9));
	 	
	Возврат Хранилище;
    	
КонецФункции

 
/////////База НАХ ////////////////////////////


Функция Раскодировать64ВАдресе(НачСтр)
	
	База="ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
	
	Стр=СокрЛП(НачСтр);
	
	СтрокаБит="";
	
	Длина=СтрДлина(Стр);
	
	ПолнаяСтрока="";
	Для Сч=1 По Длина Цикл
		Символ=Сред(Стр,Сч,1);
		Десятичное=Найти(База,Символ)-1;		
		СтрокаБит=СтрокаБит+Сред(Бинарное(Десятичное),3);		
	КонецЦикла;
	              
	СтрокаИсходная="";
	Пока СтрДлина(СтрокаБит)>0 Цикл		
		БитовоеЗначение=Лев(СтрокаБит,8);
		
		СтрокаИсходная	=СтрокаИсходная+СимволпоБайтовомуКоду(Десятичное(БитовоеЗначение));			    
		СтрокаБит		=Сред(СтрокаБит,9);
	КонецЦикла;                      
	
	Возврат СтрокаИсходная;	    
КонецФункции            


Функция Бинарное(НачЗн)
	Зн=НачЗн;	
	Стр="";	
	Для Сч=1 по 8 Цикл
		Бит=Зн%2;
		
		Стр=""+Бит+Стр;   
		Зн=(Зн-Бит)/2;		
	КонецЦикла;     
	
	Возврат Стр;
КонецФункции //

Функция Десятичное(НачЗн)
	Зн=0;
	База=128;
	
	ТекДлинна=Мин(СтрДлина(НачЗн),8);
	
	Для Сч=1 по ТекДлинна Цикл
		Зн=Зн+База*Число(Сред(НачЗн,Сч,1));					    
		База=База/2;
	КонецЦикла;
	
	Возврат Зн;
КонецФункции //Десятичное 

Функция СимволПоБайтовомуКоду(Код)
	Возврат Символ(Код);
КонецФункции 
 
 Функция РазложитьСтрокуВАдресе(Знач Стр, Разделитель = ",") 
	
	МассивСтрок = Новый Массив();
	
	Если Разделитель = " " Тогда
		
		Стр = СокрЛП(Стр);
		
		Пока 1 = 1 Цикл
			
			Поз = Найти(Стр,Разделитель);
			
			Если Поз = 0 Тогда
				
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
				
			КонецЕсли;
			
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
			
		КонецЦикла;
		
	Иначе
		
		ДлинаРазделителя = СтрДлина(Разделитель);
		
		Пока 1 = 1 Цикл
			
			Поз = Найти(Стр,Разделитель);
			Если Поз = 0 Тогда
				
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
				
			КонецЕсли;
			
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			
			Стр = Сред(Стр,Поз + ДлинаРазделителя);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // глРазложить

/////////////Формирования QR кода для документов АДРЕССА/////////////////

//передаем ссылку на любой документ в ответ получаем картинку со штрихкодом  
//в QR код кодируем ГУИД документа

 Функция ВернутьQRкодКартинкой(ТекДок)  Экспорт
	
 РезультатПодключения = ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодов", "BarcodeSymbolicName", , ТипПодключенияВнешнейКомпоненты.Изолированно);
 Генератор = Новый("AddIn.BarcodeSymbolicName.Barcode");
 
 
 ГУИДССЫЛКИ	= ТекДок.Ссылка.УникальныйИдентификатор();
    
 Генератор.АвтоТип            = Ложь; // если Истина, то ТипКода можно не указывать  
 Генератор.ТипКода            = 16;  //QR Код
 Генератор.ЗначениеКода       = Строка(ГУИДССЫЛКИ); // Строка или Base64Строка
 
 Генератор.ПрозрачныйФон      = Истина; 
 Генератор.ТипВходныхДанных   = 0; // 0 - строка, 1 - base64Строка
 Генератор.УбратьЛишнийФон    = Истина; 
 Генератор.УровеньКоррекцииQR = 1;
 
 ДДШтрихкод = Генератор.ПолучитьШтрихкод();
 
 Если ДДШтрихкод<>Неопределено Тогда
	 Возврат Новый Картинка(ДДШтрихкод);
 иначе
	 Возврат Неопределено;
 КонецЕсли;

КонецФункции


Функция ВернутьДокументПоГУИД(ГУИД) Экспорт 
	
	//передаем ГУИД документа  и получаем ссылку на документ
	
	Если ТипЗнч(ГУИД) = Тип("Строка") Тогда
		GUID= новый УникальныйИдентификатор(ГУИД);
	Иначе
		GUID = ГУИД;
	КонецЕсли;       
	
	//первоначально будет использовать шк для листов набора
	Ссылка = Документы.ЛистНабора.ПолучитьСсылку(GUID);

	Если Найти(СокрЛП(Ссылка), "<Объект не найден>") = 0 Тогда
		Возврат Ссылка;	
	КонецЕсли;  	
	//первоначально будет использовать шк для листов набора
	
	МойДок= Неопределено;
	Для Каждого Мета из Метаданные.Документы Цикл
		Ссылка = Документы[Мета.Имя].ПолучитьСсылку(GUID);
		Если Найти(СокрЛП(Ссылка), "<Объект не найден>") > 0 Тогда
			Продолжить;
		Иначе  
			МойДок=Ссылка; 		
			Прервать;
		КонецЕсли;
	КонецЦикла;    
	
	Возврат МойДок;	
	
КонецФункции


///////////////////////////////////////////////////////////////////////


Функция МассивОНоменклатура(Штрихкод) Экспорт 
	//если получаем номенклатуру код
	//получим сразу описание Номенклатуры,
	//чтобы потом не дергать. Опционально, на подумать.
		
	МассивСтр = Новый Массив;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихКоды.Владелец КАК Владелец
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Наименование = &Штрихкод"; 
	
	Запрос.Параметры.Вставить("Штрихкод", Штрихкод); 	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда	
		
		МассивСтр = МассивОТоваре(ВыборкаДетальныеЗаписи.Владелец); 
		
	Иначе
		
		//штрихкод не найден в базе
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат МассивСтр; 	
	
КонецФункции         


Функция МассивОТоваре(ТекТовар)  Экспорт    
	
	//передаем ссылка на справочник Номенклатура
			
	МассивСтр = Новый Массив;  
	РодТовара = ТекТовар.Родитель;  
	
	НоваяСтр = Новый Соответствие; 
	НоваяСтр.Вставить("Код",           ТекТовар.Код);
	НоваяСтр.Вставить("Наименование",  ТекТовар.Наименование); 				
	НоваяСтр.Вставить("КодР",          РодТовара.Код);
	НоваяСтр.Вставить("НаименованиеР", РодТовара.Наименование);		
	НоваяСтр.Вставить("ШтукВКоробке",  РодТовара.ШтукВКоробке);
	НоваяСтр.Вставить("ШтукВКоробочке",РодТовара.ШтукВКоробочке);  
	
	МассивСтр.Добавить(НоваяСтр);   //информация о товаре		
	
	ЗапросВ = Новый Запрос;
	ЗапросВ.Текст = 
	"ВЫБРАТЬ
	|	ШтрихКоды.Наименование КАК Наименование,
	|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.ВидШК) КАК ВидШК,
	|	ПРЕДСТАВЛЕНИЕ(ШтрихКоды.ТипШК) КАК ТипШК,
	|	ШтрихКоды.Код КАК КодШК
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Владелец = &Владелец";
	ЗапросВ.Параметры.Вставить("Владелец", ТекТовар); 		
	ЗапросВ.Параметры.Вставить("ВидШК",    Перечисления.ВидыШК.Основной); 
	
	РезультатВ = ЗапросВ.Выполнить().Выгрузить();
	
	МассивСтр.Добавить(РезультатВ); //информация о штрихкоде
	
	
	Возврат МассивСтр; 	
	
КонецФункции         

///////////////////////////////////////////////////////////////////////

Функция СохранитьНужныйДокумент() Экспорт  
	
	//на будущее пока не будем использовать
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Перемещение.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Перемещение.Изменения КАК Перемещение
	|ГДЕ
	|	Перемещение.Узел = &Узел";
	//Параметры запроса       
	
	МойУзел =ПланыОбмена.ОбменНАХ.НайтиПоКоду("000000002");
	ОснСклад=Справочники.Склады.НайтиПоКоду("STA-48");
	
	Запрос.УстановитьПараметр("Узел",МойУзел);// Обмен НАХ
	Результат = Запрос.Выполнить().Выбрать();   
	
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.Колонки.Добавить("ВидДвижения");
	
	Пока Результат.Следующий() Цикл
		
		НаборЗаписей = РегистрыНакопления.ОстаткиТМЦ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Результат.Ссылка); 
		НаборЗаписей.Прочитать();     
		
		Для каждого стрЗап из НаборЗаписей Цикл  
			
			Если стрЗап.Склад =ОснСклад Тогда				
				НовСТр = ТЗ.Добавить();
				НовСтр.Номенклатура    =   СтрЗап.Номенклатура.Наименование; 
				НовСтр.Количество      =   СтрЗап.Количество;
				Если СтрЗап.ВидДвижения=   ВидДвиженияНакопления.Расход Тогда
					НовСтр.ВидДвижения =   Ложь;
				Иначе  
					НовСтр.ВидДвижения =   Истина;
				КонецЕсли;				
			КонецЕсли;    		
		КонецЦикла;
		
	КонецЦикла;   
	
	Возврат ТЗ;
	
КонецФункции      

 //ТЮА 17.12.2025
Функция ВернутьЗНБпоШтрихкоду(ШКЗНБ) Экспорт
	
	ЗНБ_Строкой = Раскодировать64ВАдресе(ШКЗНБ);
	МассивЗНБ   = РазложитьСтрокуВАдресе(ЗНБ_Строкой,"*");
	ЗНБ = Документы.ЗаданиеНабора.НайтиПоНомеру(МассивЗНБ[2],Дата("20"+МассивЗНБ[3],1,1));

	Возврат ЗНБ;
	
КонецФункции 


////ТЮА 03.02.2026 


//таблицаЗначение
  //-Номенклатура
  //-Количество
//ДокСсылка = ссылка на План Набора

Функция ВернутьОстатокНоменклатурыВАдресномХранении(ТаблицаИсх, ДокСсылка) Экспорт
	
	//Т.Ю.А, 04.02.26
	ТаблицаКодов = ТаблицаИсх.Скопировать();
		 
	Если ТаблицаКодов.Количество()>0 Тогда
		
		//проверим на дубли
		ТаблицаКодов.Свернуть("Код");
		
		Прокси	= Неопределено;	  
		
		ПроксиАдрес = ВернутьПроксиНАХ();  
		
		Если ПроксиАдрес = Неопределено Тогда   
			Возврат Неопределено;	
		КонецЕсли;       
		
		МассивТЗ=Новый Массив;  		
		
		СтрДокумента = Новый Структура;
		СтрДокумента.Вставить("ГУИДРНК", Строка(ДокСсылка.УникальныйИдентификатор()));
		СтрДокумента.Вставить("НадпРНК", Строка(ДокСсылка));   
		
			
		//ТЮА  Строка(ДокСсылка.Накладная)
		
		МассивТЗ.Добавить(СтрДокумента);
		МассивТЗ.Добавить(ТаблицаКодов); 	
		
		ДанныеИзАдрес = ПроксиАдрес.ОстаткиТовараДляЗНБ(ЗначениеВХранилище(МассивТЗ));               //
		Если ДанныеИзАдрес = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		МассивИзАдрес = ЗначениеИзХранилища(ДанныеИзАдрес); 
		ТЗТовараКод = МассивИзАдрес[0];		
				
		Если ТЗТовараКод.Количество()=0 Тогда
			
			Возврат Неопределено; 
			
		Иначе
			
			ТЗНоменклатура = ПреобразоватьТЗКодыВНоменклатуру(ТЗТовараКод); 		
			Возврат ТЗНоменклатура;                                         
			
		КонецЕсли;
				
	Иначе
		Возврат Неопределено;
	КонецЕсли;


КонецФункции   


Функция ПреобразоватьТЗКодыВНоменклатуру(ТЗКоды) Экспорт
	
	Запрос = Новый Запрос;   
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗКОДЫ.Код КАК Код,
	|	ТЗКОДЫ.Количество КАК Количество
	|ПОМЕСТИТЬ ЗаруженыКоды
	|ИЗ
	|	&ТЗКОДЫ КАК ТЗКОДЫ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаруженыКоды.Код КАК Код,
	|	СУММА(ЗаруженыКоды.Количество) КАК Количество
	|ПОМЕСТИТЬ НужныйКоды
	|ИЗ
	|	ЗаруженыКоды КАК ЗаруженыКоды
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаруженыКоды.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВыбТовар
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Код В
	|			(ВЫБРАТЬ
	|				НужныйКоды.Код КАК Код
	|			ИЗ
	|				НужныйКоды КАК НужныйКоды)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""000000002"" КАК Сектор,
	|	ВыбТовар.Ссылка КАК Номенклатура,
	|	НужныйКоды.Количество КАК КоличествоВСекторе
	|ИЗ
	|	НужныйКоды КАК НужныйКоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыбТовар КАК ВыбТовар
	|		ПО (ВыбТовар.Ссылка.Код = НужныйКоды.Код)
	|";
	Запрос.УстановитьПараметр("ТЗКоды",ТЗКоды);
	
	ТЗРезультат= Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗРезультат;
	
КонецФункции          




Функция ПечатьЗНБ(Объект,ДопПараметры=Неопределено)  Экспорт
	Прокси	= Неопределено;	  
	
	ПроксиАдрес = ВернутьПроксиНАХ();  
	
	Если ПроксиАдрес = Неопределено Тогда   
		Возврат Неопределено;	
	КонецЕсли;       
	
	МассивТЗ=Новый Массив;  		
				
	МассивТЗ.Добавить(Строка(Объект.Ссылка.УникальныйИдентификатор()));
 	МассивТЗ.Добавить(ДопПараметры);
	
	ДанныеИзАдрес = ПроксиАдрес.ПечатьЗНБ(ЗначениеВХранилище(МассивТЗ));               //
	Если ДанныеИзАдрес = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат ЗначениеИзХранилища(ДанныеИзАдрес);
	
КонецФункции        





/////////////Тимофеев Ю.А. 14.03.2026 1 сотрудник = 1 работа  NL-105 ////////////////////////////////// 


 Функция НуженКонтрольЗанятостиСотрудника()
	
	//Если есть запись КонтрольБиржиЗанятости со значением ИСТИНА
	//функции работают
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита";
	//Параметры запроса
	Запрос.УстановитьПараметр("ИмяРеквизита","КонтрольБиржиЗанятости");// Строка
	Результат = Запрос.Выполнить().Выбрать();

	Если Результат.Следующий() Тогда
		Возврат Результат.ЗначениеРеквизита;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции   

Процедура СотрудникВыборИзмена(Элемент,СтандартнаяОбработка) Экспорт 
	
	//при выборе или изменении реквизита физ.лицо в документах

	Если НуженКонтрольЗанятостиСотрудника() Тогда
		
		ОтветСТр = ADRESS.ПроверитьСтатусСотрудника(Элемент.Значение);
		
		Если ОтветСТр.Результат Тогда
			#Если Клиент Тогда
			Предупреждение(ОтветСТр.Ответ,7,"Выбранный сотрудник - занят");
			Элемент.Значение     = Справочники.ФизическиеЛица.ПустаяСсылка();
			СтандартнаяОбработка = ложь;
			#КонецЕсли
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

Функция ПроверимРеквизитыФизическиеЛица(ОбъектДокумент)  Экспорт
	
	Ссылка = ОбъектДокумент.Ссылка;
	ИмяДокумента = ОбъектДокумент.Метаданные().Имя;
	
	Док = Метаданные.Документы[ИмяДокумента];  
	
	ТЗФизЛиц = Неопределено;	
	
	ТЗНезатятыхСотрудников = Новый ТаблицаЗначений;
	ТЗНезатятыхСотрудников.Колонки.Добавить("Сотрудник");
	
	ФизЛица = Тип("СправочникСсылка.ФизическиеЛица");
	
	Для Каждого Реквизит Из Док.Реквизиты Цикл   
		РаботникЗанят = Ложь; 	
		Если Реквизит.Тип.СодержитТип(ФизЛица) Тогда
			//если нужный и заполнен            
			ЗначРеквизита = Ссылка[Строка(Реквизит.Имя)];
			
			Если ЗначениеЗаполнено(ЗначРеквизита) Тогда 
				//проверка на повторение реквизита
				Если ТЗФизЛиц = Неопределено Тогда
					
					//проверим по регистру СтатусРаботыСотрудника
					ПроверкаФЛ = СтатусРаботыСотрудника(ЗначРеквизита,Ссылка);
					
					Если ПроверкаФЛ.Ответ Тогда  					
						
						ТЗФизЛиц = ПроверкаФЛ.ТЗ;			   
						
						КрайСтрока = ТЗФизЛиц.Получить(ТЗФизЛиц.Количество()-1);
						
						РаботникЗанят = Истина; 
					Иначе
						НовНез = ТЗНезатятыхСотрудников.Добавить();
						НовНез.Сотрудник=ЗначРеквизита;
						
					КонецЕсли; 
					
				Иначе   
					
					КрайСтрока = ТЗФизЛиц.Найти(ЗначРеквизита,"Сотрудник");
					
					Если КрайСтрока=Неопределено Тогда
						
						ПроверкаФЛ = СтатусРаботыСотрудника(ЗначРеквизита,Ссылка);
						
						Если ПроверкаФЛ.Ответ Тогда  					
							
							Для Каждого Стр из ПроверкаФЛ.ТЗ Цикл
								НовСтр = ТЗФИЗЛиц.Добавить();
								ЗаполнитьЗначенияСвойств(НовСтр,Стр);								
							КонецЦикла;  							
							
							КрайСтрока = ТЗФизЛиц.Получить(ТЗФизЛиц.Количество()-1);
							
							РаботникЗанят = Истина;		
							
						Иначе
							
							НовНез = ТЗНезатятыхСотрудников.Добавить();
							НовНез.Сотрудник=ЗначРеквизита;
	
						КонецЕсли; 		
						
					Иначе  
						
						КрайСтрока=Неопределено;	
						РаботникЗанят = Истина;						
						
					КонецЕсли;
				КонецЕсли;	       				 
			КонецЕсли;  
			
			Если РаботникЗанят Тогда      
				
				Если КрайСтрока<>Неопределено Тогда 
					#Если Клиент Тогда
						Предупреждение("Информация на "+ФОрмат(ТекущаяДата(),"ДФ=; ДЛФ=DDT")+"Сотрудник "+Строка(КрайСтрока.Сотрудник)+Символы.ПС+"Занят с "+Строка(КрайСтрока.ДатаНачала)
						+Символы.ПС+"Документ: "+Строка(КрайСтрока.ДокументОснования),,"Сотрудник занят");
					#КонецЕсли
					
				КонецЕсли;    
				
				ОбъектДокумент[Строка(Реквизит.Имя)] = Справочники.ФизическиеЛица.ПустаяСсылка();
				
			Иначе   
				
				ТЗНезатятыхСотрудников.Свернуть("Сотрудник");
				
				Для каждого незанят из ТЗНезатятыхСотрудников Цикл
					
					ИзменитьСтатусСотрудника(незанят.Сотрудник,ОбъектДокумент);
					
				КОнецЦикла;
				
			КОнецЕсли;  
			
		КонецЕсли;       
		
	КонецЦикла;   
	
	Возврат РаботникЗанят;
	
КонецФункции   

Процедура ИзменитьСтатусСотрудника(СсылкаСотрудник,ДокОснование) Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	СтатусРаботыСотрудникаСрезПоследних.ДокументОснования КАК ДокументОснования,
	//|	СтатусРаботыСотрудникаСрезПоследних.ДатаНачала КАК ДатаНачала,
	//|	СтатусРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник
	//|ИЗ
	//|	РегистрСведений.СтатусРаботыСотрудника.СрезПоследних(
	//|			,
	//|			Сотрудник = &Сотрудник
	//|				И ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)) КАК СтатусРаботыСотрудникаСрезПоследних
	//|ГДЕ
	//|	 СтатусРаботыСотрудникаСрезПоследних.ДокументОснования = &ДокументОснования
	//|";
	////Параметры запроса
	//Запрос.УстановитьПараметр("ДокументОснования",ДокОснование);// Докумнет
	//Запрос.УстановитьПараметр("Сотрудник",        СсылкаСотрудник);// Физические лица
	//Результат = Запрос.Выполнить().Выбрать(); 
	//
	//Если Результат.Следующий() Тогда
	//	
	//	РегЗап = РегистрыСведений.СтатусРаботыСотрудника.СоздатьНаборЗаписей();
	//	
	//	НаборЗаписей = РегистрыСведений.СтатусРаботыСотрудника.СоздатьНаборЗаписей();    
	//	НаборЗаписей.Отбор.Сотрудник.Установить(СсылкаСотрудник); 
	//	НаборЗаписей.Отбор.ДокументОснования.Установить(ДокОснование);

	//	НаборЗаписей.Прочитать();
	//	МенеджерЗаписи = РегистрыСведений.СтатусРаботыСотрудника.СоздатьМенеджерЗаписи();
	//	
	//	Для Каждого ТекЗапись Из НаборЗаписей Цикл
	//		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекЗапись);
	//		МенеджерЗаписи.Прочитать();
	//		МенеджерЗаписи.ДатаОкончания = ТекущаяДата();;
	//		МенеджерЗаписи.Записать();
	//	КонецЦикла; 
	//	
	//Иначе
		
		МенеджерЗаписи = РегистрыСведений.СтатусРаботыСотрудника.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.Период             = ТекущаяДата();
		МенеджерЗаписи.Сотрудник          = СсылкаСотрудник;
		МенеджерЗаписи.ДокументОснования  = ДокОснование;
		МенеджерЗаписи.ДатаНачала         = ДокОснование.Дата;
		МенеджерЗаписи.Записать(Истина);
		
	//КонецЕсли;

КонецПроцедуры    

Функция ПроверитьСтатусСотрудника(СсылкаСотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтатусРаботыСотрудникаСрезПоследних.ДокументОснования КАК ДокументОснования,
	|	СтатусРаботыСотрудникаСрезПоследних.ДатаНачала КАК ДатаНачала,
	|	СтатусРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.СтатусРаботыСотрудника.СрезПоследних(
	|			,
	|			Сотрудник = &Сотрудник
	|				И ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)) КАК СтатусРаботыСотрудникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник",  СсылкаСотрудник);// Физические лица
	Результат = Запрос.Выполнить().Выбрать(); 
	
	Если Результат.Следующий() Тогда
		СтрОтвета = Новый Структура;
		СтрОтвета.Вставить("Результат",Истина);
		СтрОтвета.Вставить("Ответ","Информация на: "+Формат(ТекущаяДата(),"ДЛФ=DT")+Символы.ПС+"Сотрудник: -< "+Строка(СсылкаСотрудник)+" >- занят."+Символы.ПС+"Основание:"+Строка(Результат.ДокументОснования)); 
		Возврат СтрОтвета;	
	Иначе
		СтрОтвета = Новый Структура;
		СтрОтвета.Вставить("Результат",Ложь);
		Возврат СтрОтвета;	
	КонецЕсли;
	
КонецФункции      

Процедура ЛокальноСнятьЗанятостьСотрудника(СсылкаСотрудник,ДокОснование=Неопределено,Комментарий="") Экспорт  
	
	Если СсылкаСотрудник<>Неопределено Тогда 
				
		Запрос = Новый Запрос; 
		
		Если ДокОснование=Неопределено Тогда
			
			ДатаОтбора = НачалоДня(ТекущаяДата()-86400*3);
			УсловиеПоДокументу=" И СтатусРаботыСотрудника.Период МЕЖДУ &НачПериода И &КонПериода И СтатусРаботыСотрудника.ДатаОкончания = &ДатаОкончания";
			Запрос.УстановитьПараметр("ДатаОкончания",Дата(1,1,1));// Дата
			Запрос.УстановитьПараметр("НачПериода",ДатаОтбора);// Дата 
			
		Иначе
			
			УсловиеПоДокументу=" И СтатусРаботыСотрудника.ДокументОснования = &ДокументОснования"; 
			Запрос.УстановитьПараметр("ДокументОснования",ДокОснование);// Дата 
			
		КонецЕсли;
		
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	СтатусРаботыСотрудника.Период КАК Период,
		               |	СтатусРаботыСотрудника.Сотрудник КАК Сотрудник,
		               |	СтатусРаботыСотрудника.ВидРаботы КАК ВидРаботы,
		               |	СтатусРаботыСотрудника.ДокументОснования КАК ДокументОснования,
		               |	СтатусРаботыСотрудника.ДатаНачала КАК ДатаНачала,
		               |	&КонПериода КАК ДатаОкончания,
		               |	&Комментарий КАК Комментарий
		               |ИЗ
		               |	РегистрСведений.СтатусРаботыСотрудника КАК СтатусРаботыСотрудника
		               |ГДЕ
		               |	СтатусРаботыСотрудника.Сотрудник = &Сотрудник"+УсловиеПоДокументу;
		//Параметры запроса
		Запрос.УстановитьПараметр("Сотрудник",  СсылкаСотрудник);// Физические лица  
		Запрос.УстановитьПараметр("КонПериода",ТекущаяДата());// Дата
		Запрос.УстановитьПараметр("Комментарий",Комментарий);// Дата

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();    
		
		Пока Выборка.Следующий() Цикл     
			
			МенеджерЗаписи = РегистрыСведений.СтатусРаботыСотрудника.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
			МенеджерЗаписи.Записать(Истина);

		КонецЦикла;
        		
	КонецЕсли;
	 
 КонецПроцедуры



Процедура ДобавитьЗанятостьСотрудника(СсылкаСотрудник,ДокОснование) Экспорт     
	
	 МенеджерЗаписи = РегистрыСведений.СтатусРаботыСотрудника.СоздатьМенеджерЗаписи(); 
	 МенеджерЗаписи.Период             = ТекущаяДата();
	 МенеджерЗаписи.Сотрудник          = СсылкаСотрудник;
	 МенеджерЗаписи.ДокументОснования  = ДокОснование;
	 МенеджерЗаписи.ДатаНачала         = ДокОснование.Дата;
	 МенеджерЗаписи.Записать(Истина); 
	 
 КонецПроцедуры   
  
Процедура СнятьЗанятостьСотрудника(СтрокиПланНабора,ДокОснование=Неопределено,Комментарий="") Экспорт   
	 
	//по строкам ПЛАНА НАБОРА
	 
	Если СтрокиПланНабора<>Неопределено Тогда 
		
		//все колонки табличной части документа ПЛАН НАБОРА	 
		БудемПроверятьРеквизиты=Метаданные.Документы.ПЛанНабора.ТабличныеЧасти.тБрэндов.Реквизиты;
		ФизЛица                = Тип("СправочникСсылка.ФизическиеЛица");   
		
		//создаем временную таблицу для хранеия сотрудника
		ТЗСотр = Новый ТаблицаЗначений;
		ТЗСотр.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		
		Для Каждого СтрокаТЧ Из СтрокиПланНабора Цикл 
			
			Для каждого стрРекв из БудемПроверятьРеквизиты Цикл 		  
				
				Если стрРекв.Тип.СодержитТип(ФизЛица) Тогда
					//если нужный и заполнен            
					СсылкаСотрудник = СтрокаТЧ[Строка(стрРекв.Имя)];
					
					Если ЗначениеЗаполнено(СсылкаСотрудник) Тогда		
						
						НовСОтр= ТЗСотр.Добавить();
						НовСотр.Сотрудник = СсылкаСотрудник;	
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;   
			
		КонецЦикла;    
		
		
		//свернем  пример РНК вместо 1640 записей остается только 5
		ТЗСотр.Свернуть("Сотрудник");
		
		Для каждого ЕстьСотр из ТЗСотр Цикл
			ЛокальноСнятьЗанятостьСотрудника(ЕстьСотр.Сотрудник,ДокОснование,Комментарий);
		КонецЦикла;
		
	КонецЕсли;    
	 
 КонецПроцедуры     
 
 Процедура СнятьЗанятостьСотрудникаПоПланНабору(ПНСсылка,ДокОснование=Неопределено,Комментарий="") Экспорт   
	 
	 //ПО ДОКУМЕНТУ ПЛАН НАБОРА
	 
	 //все колонки табличной части документа ПЛАН НАБОРА	 
	 БудемПроверятьРеквизиты=Метаданные.Документы.ПЛанНабора.ТабличныеЧасти.тБрэндов.Реквизиты;
	 ФизЛица                = Тип("СправочникСсылка.ФизическиеЛица");   
	 
	 //создаем временную таблицу для хранеия сотрудника
	 ТЗСотр = Новый ТаблицаЗначений;
	 ТЗСотр.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	 
	 
	 Если ПНСсылка<>Неопределено Тогда      
		 
		 Для Каждого СтрокаТЧ Из ПНСсылка.тБрэндов Цикл   				
			 
			 Для каждого стрРекв из БудемПроверятьРеквизиты Цикл 		  
				 
				 Если стрРекв.Тип.СодержитТип(ФизЛица) Тогда
					 //если нужный и заполнен            
					 СсылкаСотрудник = СтрокаТЧ[Строка(стрРекв.Имя)];
					 
					 Если ЗначениеЗаполнено(СсылкаСотрудник) Тогда		
						 НовСОтр= ТЗСотр.Добавить();
						 НовСотр.Сотрудник = СсылкаСотрудник;							
					 КонецЕсли;
					 
				 КонецЕсли;
				 
			 КонецЦикла;    
			 
		 КонецЦикла;   
		 //свернем  пример РНК вместо 1640 записей остается только 5
		 ТЗСотр.Свернуть("Сотрудник");
		 
		 Для каждого ЕстьСотр из ТЗСотр Цикл
			 ЛокальноСнятьЗанятостьСотрудника(ЕстьСотр.Сотрудник,ПНСсылка,Комментарий);
		 КонецЦикла;
		 
	 КонецЕсли;    
	 
 КонецПроцедуры
 

Функция СтатусРаботыСотрудника(СсылкаСотрудник,КромеДок)  Экспорт
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	//               |ПОМЕСТИТЬ РазрешененныеГруппы
	//               |ИЗ
	//               |	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	//               |ГДЕ
	//               |	РеквизитыСправочников.ИмяРеквизита = &ИмяРеквизита
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	СтатусРаботыСотрудникаСрезПоследних.ДокументОснования КАК ДокументОснования,
	//               |	СтатусРаботыСотрудникаСрезПоследних.ДатаНачала КАК ДатаНачала,
	//               |	СтатусРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник
	//               |ИЗ
	//               |	РегистрСведений.СтатусРаботыСотрудника.СрезПоследних(
	//               |			,
	//               |			Сотрудник = &Сотрудник
	//               |				И ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)) КАК СтатусРаботыСотрудникаСрезПоследних
	//               |ГДЕ
	//               |	НЕ СтатусРаботыСотрудникаСрезПоследних.Сотрудник.Родитель В ИЕРАРХИИ
	//               |				(ВЫБРАТЬ
	//               |					РазрешененныеГруппы.ЗначениеРеквизита КАК ЗначениеРеквизита
	//               |				ИЗ
	//               |					РазрешененныеГруппы КАК РазрешененныеГруппы)
	//               |	И СтатусРаботыСотрудникаСрезПоследних.ДокументОснования <> &ДокументОснования";
	//
	////ТЮА "НЕ В" в 4 раза быстрее 0,08 сек против "НЕ В ИЕРАРХИИ" 0,27 сек
	//
	//Запрос.УстановитьПараметр("ИмяРеквизита",    "ЭтиГруппыСотрудниковНеПроверять"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтатусРаботыСотрудникаСрезПоследних.ДокументОснования КАК ДокументОснования,
	|	СтатусРаботыСотрудникаСрезПоследних.ДатаНачала КАК ДатаНачала,
	|	СтатусРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.СтатусРаботыСотрудника.СрезПоследних(
	|			,
	|			Сотрудник = &Сотрудник
	|				И ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)) КАК СтатусРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	СтатусРаботыСотрудникаСрезПоследних.ДокументОснования <> &ДокументОснования";
	//Параметры запроса

	
	Запрос.УстановитьПараметр("Сотрудник",        СсылкаСотрудник);// Физические лица   
	Запрос.УстановитьПараметр("ДокументОснования",КромеДок);// Документ ссылка 
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	
	ОтветСтр = Новый Структура;
	
	Если Результат.Количество()>0 Тогда
		ОтветСтр.Вставить("Ответ",Истина);
		ОтветСтр.Вставить("ТЗ",Результат);
	Иначе
		ОтветСтр.Вставить("Ответ",Ложь);
	КонецЕсли;
	
	Возврат ОтветСтр;
	
КонецФункции



Функция СотрудникИзСканера(СсылкаСотрудник) Экспорт 
	
	//при выборе или изменении реквизита физ.лицо в документах
	
	Если НуженКонтрольЗанятостиСотрудника() Тогда
		
		ОтветСТр = ADRESS.ПроверитьСтатусСотрудника(СсылкаСотрудник);
		
		Если ОтветСТр.Результат Тогда
			#Если Клиент Тогда
				Предупреждение(ОтветСТр.Ответ,7,"Выбранный сотрудник - занят");
			#КонецЕсли
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

 
/////////////Тимофеев Ю.А. 14.03.2026 1 сотрудник = 1 работа  NL-105 ////////////////////////////////// 



/////////////Тимофеев Ю.А. 30.03.2026 Частичное завершение ЗНБ  NL-86 ////////////////////////////////// 


// функция проверяет расходждения между ЗНБ и листами набора по РНК
// если есть разница (несобран товар) текущий ЗНБ закрывает с пометкой "Частично собран"
// и создается новое ЗНБ с остатком товара и корректируется документ ПЛАН НАБОРА


// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
//Функция ПолучитьРасхожденияЛистовНабораИЗНБ(ЗНБ) Экспорт 
Функция ПолучитьРасхожденияЛистовНабораИЗНБ(ЗНБ, ТекстОповещения = "") Экспорт 
	// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
	
	// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
	//Если ЗНБ.ЧастичноСобран Тогда
	//	Возврат Ложь;
	//КонецЕсли;	
	//
	////Накладная из ЗНБ	
	//ТекРНК = ЗНБ.Накладная;
	РеквизитыШапкиЗНБ = ПолучитьРеквизитыШапки(ЗНБ, "ЧастичноСобран, Накладная", "Документ");
	
	Если РеквизитыШапкиЗНБ.ЧастичноСобран Тогда
		
		ТекстОповещения = "Документ ЗНБ был частично завершён ранее";
		
		Возврат Ложь;
		
	КонецЕсли;	
	
	ТекРНК = РеквизитыШапкиЗНБ.Накладная;
	// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
			
	// Кельманов А.В. - ПРО-0000000101 - 2026.06.17 {
	//Если ТекРНК.ОтгрузкаКомплектов Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	ЛистНабораЗаданияНабора.Ссылка КАК Ссылка
	//	|ПОМЕСТИТЬ ЛНЗНБ
	//	|ИЗ
	//	|	Документ.ЛистНабора.ЗаданияНабора КАК ЛистНабораЗаданияНабора
	//	|ГДЕ
	//	|	ЛистНабораЗаданияНабора.ЗаданиеНабора = &ЗаданиеНабора
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	//	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	//	|ПОМЕСТИТЬ ВЛРЕЗУЛЬТАТ
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
	//	|		СУММА(РасходнаяНакладнаяКомплектующие.Количество) КАК Количество
	//	|	ИЗ
	//	|		Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	//	|	ГДЕ
	//	|		РасходнаяНакладнаяКомплектующие.Ссылка.Проведен
	//	|		И РасходнаяНакладнаяКомплектующие.Ссылка = &ДокРНК
	//	|		И РасходнаяНакладнаяКомплектующие.Ссылка.Дата >= &Дата
	//	|	
	//	|	СГРУППИРОВАТЬ ПО
	//	|		РасходнаяНакладнаяКомплектующие.Номенклатура
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		ЛистНабораТовары.Номенклатура,
	//	|		СУММА(-ЛистНабораТовары.Количество)
	//	|	ИЗ
	//	|		Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	//	|	ГДЕ
	//	|		ЛистНабораТовары.Ссылка В
	//	|				(ВЫБРАТЬ
	//	|					ЛНЗНБ.Ссылка КАК Ссылка
	//	|				ИЗ
	//	|					ЛНЗНБ КАК ЛНЗНБ)
	//	|		И ЛистНабораТовары.Ссылка.ДокОснование = &ДокРНК
	//	|		И ЛистНабораТовары.Ссылка.Проведен
	//	|		И ЛистНабораТовары.Ссылка.Дата >= &Дата
	//	|	
	//	|	СГРУППИРОВАТЬ ПО
	//	|		ЛистНабораТовары.Номенклатура) КАК ВложенныйЗапрос
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВложенныйЗапрос.Номенклатура
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВЛРЕЗУЛЬТАТ.Номенклатура КАК Номенклатура,
	//	|	ВЛРЕЗУЛЬТАТ.Количество КАК Количество
	//	|ИЗ
	//	|	ВЛРЕЗУЛЬТАТ КАК ВЛРЕЗУЛЬТАТ
	//	|ГДЕ
	//	|	ВЛРЕЗУЛЬТАТ.Количество > 0";
	//	
	//	
	//Иначе
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	ЛистНабораЗаданияНабора.Ссылка КАК Ссылка
	//	|ПОМЕСТИТЬ ЛНЗНБ
	//	|ИЗ
	//	|	Документ.ЛистНабора.ЗаданияНабора КАК ЛистНабораЗаданияНабора
	//	|ГДЕ
	//	|	ЛистНабораЗаданияНабора.ЗаданиеНабора = &ЗаданиеНабора
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	//	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	//	|ПОМЕСТИТЬ ВЛРЕЗУЛЬТАТ
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	//	|		СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество
	//	|	ИЗ
	//	|		Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	//	|	ГДЕ
	//	|		РасходнаяНакладнаяТовары.Ссылка.Проведен
	//	|		И РасходнаяНакладнаяТовары.Ссылка = &ДокРНК
	//	|		И РасходнаяНакладнаяТовары.Ссылка.Дата >= &Дата
	//	|	
	//	|	СГРУППИРОВАТЬ ПО
	//	|		РасходнаяНакладнаяТовары.Номенклатура
	//	|	
	//	|	ОБЪЕДИНИТЬ ВСЕ
	//	|	
	//	|	ВЫБРАТЬ
	//	|		ЛистНабораТовары.Номенклатура,
	//	|		СУММА(-ЛистНабораТовары.Количество)
	//	|	ИЗ
	//	|		Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	//	|	ГДЕ
	//	|		ЛистНабораТовары.Ссылка В
	//	|				(ВЫБРАТЬ
	//	|					ЛНЗНБ.Ссылка КАК Ссылка
	//	|				ИЗ
	//	|					ЛНЗНБ КАК ЛНЗНБ)
	//	|		И ЛистНабораТовары.Ссылка.ДокОснование = &ДокРНК
	//	|		И ЛистНабораТовары.Ссылка.Проведен
	//	|		И ЛистНабораТовары.Ссылка.Дата >= &Дата
	//	|	
	//	|	СГРУППИРОВАТЬ ПО
	//	|		ЛистНабораТовары.Номенклатура) КАК ВложенныйЗапрос
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВложенныйЗапрос.Номенклатура
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВЛРЕЗУЛЬТАТ.Номенклатура КАК Номенклатура,
	//	|	ВЛРЕЗУЛЬТАТ.Количество КАК Количество
	//	|ИЗ
	//	|	ВЛРЕЗУЛЬТАТ КАК ВЛРЕЗУЛЬТАТ
	//	|ГДЕ
	//	|	ВЛРЕЗУЛЬТАТ.Количество > 0";
	//	
	//КонецЕсли;
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛистНабораЗаданияНабора.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ЛНЗНБ
	               |ИЗ
	               |	Документ.ЛистНабора.ЗаданияНабора КАК ЛистНабораЗаданияНабора
	               |ГДЕ
	               |	ЛистНабораЗаданияНабора.ЗаданиеНабора = &ЗаданиеНабора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВЛРЕЗУЛЬТАТ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗаданиеНабораТовары.Номенклатура КАК Номенклатура,
	               |		СУММА(ЗаданиеНабораТовары.Количество) КАК Количество
	               |	ИЗ
	               |		Документ.ЗаданиеНабора.Товары КАК ЗаданиеНабораТовары
	               |	ГДЕ
	               |		ЗаданиеНабораТовары.Ссылка.Проведен
	               |		И ЗаданиеНабораТовары.Ссылка = &ЗаданиеНабора
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЗаданиеНабораТовары.Номенклатура
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЛистНабораТовары.Номенклатура,
	               |		СУММА(-ЛистНабораТовары.Количество)
	               |	ИЗ
	               |		Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	               |	ГДЕ
	               |		ЛистНабораТовары.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ЛНЗНБ.Ссылка КАК Ссылка
	               |				ИЗ
	               |					ЛНЗНБ КАК ЛНЗНБ)
	               |		И ЛистНабораТовары.Ссылка.ДокОснование = &ДокРНК
	               |		И ЛистНабораТовары.Ссылка.Проведен
	               |		И ЛистНабораТовары.Ссылка.Дата >= &Дата
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЛистНабораТовары.Номенклатура) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЛРЕЗУЛЬТАТ.Номенклатура КАК Номенклатура,
	               |	ВЛРЕЗУЛЬТАТ.Количество КАК Количество
	               |ИЗ
	               |	ВЛРЕЗУЛЬТАТ КАК ВЛРЕЗУЛЬТАТ
	               |ГДЕ
	               |	ВЛРЕЗУЛЬТАТ.Количество > 0";
	// Кельманов А.В. - ПРО-0000000101 - 2026.06.17 }
			
	Запрос.УстановитьПараметр("Дата", ТекРНК.Дата - 30 * 86400); 
	Запрос.УстановитьПараметр("ДокРНК", ТекРНК);   
	Запрос.УстановитьПараметр("ЗаданиеНабора", ЗНБ);
	
	ЕстьРасхождения = Запрос.Выполнить().Выгрузить();
		
	Если ЕстьРасхождения.Количество() > 0 Тогда
		
		// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
		//Возврат РазделитьЗНБиИзменитьПН(ЕстьРасхождения, ЗНБ);
		Возврат РазделитьЗНБиИзменитьПН(ЕстьРасхождения, ЗНБ, ТекстОповещения);
		// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
			
	КонецЕсли;
	
	// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
	ТекстОповещения = "Нет расхождений с листами набора. ЗНБ собрано полностью";
	// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
	
	Возврат Ложь;	
		
КонецФункции   


Функция ПолучитьСледующийНомерЧасти(ПН)  Экспорт
	
	//возварщает СЛЕДУЮЩИЙ номер части для документа плана набора
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ПланНаборатБрэндов.НомерЧасти)+1 КАК НомерЧасти
	|ИЗ
	|	Документ.ПланНабора.тБрэндов КАК ПланНаборатБрэндов
	|ГДЕ
	|	ПланНаборатБрэндов.Ссылка = &ПланНабора";
	//Параметры запроса
	Запрос.УстановитьПараметр("ПланНабора",ПН);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Номерчасти;
	Иначе   	
		Возврат 1;
	КонецЕсли;

КонецФункции      

// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
//Функция РазделитьЗНБиИзменитьПН(ЕстьРасхождения, СтарыйЗНБ) 
Функция РазделитьЗНБиИзменитьПН(ЕстьРасхождения, СтарыйЗНБ, ТекстОповещения = "") 
// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
	
	//обновим нумерацию = на копии базы вылетает
	ОбновитьНумерациюОбъектов(Метаданные.Документы.ЗаданиеНабора); 
	
	НачатьТранзакцию();     
	
	ЗНБПланНабора = СтарыйЗНБ.ДокументОснование;
	
	// Кельманов А.В. - Проблема 0000000093 + Проблема 0000000099 - 2026.07.07 {
	ОбДокОсн = ЗНБПланНабора.ПолучитьОбъект();
	
	КоллекцияЭтоГруппа = Ложь;
	
	Если ОбДокОсн.тБрэндов.Количество() > 0 Тогда
		
		КоллекцияЭтоГруппа = ПолучитьРеквизитШапки(ОбДокОсн.тБрэндов[0].Коллекция, "ЭтоГруппа", "Справочник");
		
	КонецЕсли;
	// Кельманов А.В. - Проблема 0000000093 + Проблема 0000000099 - 2026.07.07 }

	//временная ТЗ для строк ПЛАНА Набора
	
	ТзДляПН = Новый ТаблицаЗначений;
	ТЗДляПН.Колонки.Добавить("Брэнд", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗДляПН.Колонки.Добавить("Коллекция", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗДляПН.Колонки.Добавить("Количество", ПолучитьОписаниеТиповЧисла(10, 0));
	ТЗДляПН.Колонки.Добавить("КоличествоДляНаборов", ПолучитьОписаниеТиповЧисла(10, 0));
	
	БылоКоличество = СтарыйЗНБ.Товары.Итог("Количество");  
	//оставим для контроля количество товара для набора после развивки  
	
	//1 из Старого ЗНБ создадим НОВЫЙ  
	
	ЗНБ = СтарыйЗНБ.ПолучитьОбъект();
	
	НовЗНБ                        = ЗНБ.Скопировать(); 
	НовЗнб.Дата                   = ЗНБ.Дата;      
	НовЗНБ.ПредыдущийЗНБ          = ЗНБ.Ссылка;
	НовЗНБ.ЧастичноСобран         = Ложь;
	НовЗНб.СобиратьВПервуюОчередь = Истина;   //для VIP печати из Журнала Синхронизаци
	НовЗНб.СостояниеНакладной     = Перечисления.СостоянияНакладной.СформированыЗаданияНабора;  
	НовЗНб.ОтправленНаТСД         = Ложь;
	НовЗНб.ЗагруженИзТСД          = Ложь;
	
	НомерНовойЧасти               = ПолучитьСледующийНомерЧасти(ЗНБПланНабора); 
	НовЗНб.НомерЧасти             = НомерНовойЧасти; 
	
	НовЗНБ.Товары.Очистить();   
	
	// Кельманов А.В. - Проблема 0000000093 + Проблема 0000000099 - 2026.07.07 {
	//для Каждого стрН из ЕстьРасхождения Цикл    
	//	
	//	Отбор = Новый Структура();
	//	Отбор.Вставить("Номенклатура",СтрН.Номенклатура);
	//	ПоискСтроки = СтарыйЗНБ.Товары.НайтиСтроки(Отбор); 
	//	
	//	//отбор и поиск нужнен для полей - ТребуетсяМаркировка и ТребуетсяМаркировка
	//	
	//	Если ПоискСтроки.Количество() > 0 Тогда
	//		
	//		ТекСтрока = ПоискСтроки[0];
	//		
	//		НоваяСтрЗНБ                      = НовЗНБ.Товары.Добавить(); 				  				  
	//		НоваяСтрЗНБ.Номенклатура         = СтрН.Номенклатура;
	//		
	//		новСтрдляПН = ТзДляПН.Добавить();     
	//		
	//		новСтрдляПН.Брэнд         =   СтрН.Номенклатура.Родитель.Родитель.Родитель;
	//		новСтрдляПН.Коллекция     =   СтрН.Номенклатура.Родитель.Родитель;
	//		новСтрдляПН.Количество    =   СтрН.Количество;
	//		
	//		НоваяСтрЗНБ.Количество           = СтрН.Количество; 
	//		Если ТекСтрока.КоличествоДляНаборов>0 Тогда
	//			НоваяСтрЗНБ.КоличествоДляНаборов = СтрН.Количество; 
	//			новСтрдляПН.КоличествоДляНаборов = СтрН.Количество;
	//		КонецЕсли;
	//		НоваяСтрЗНБ.ТребуетсяМаркировка  = ТекСтрока.ТребуетсяМаркировка;
	//		НоваяСТрЗНБ.Единица              = ТекСтрока.Единица;
	//		НоваяСТрЗНБ.Коэффициент          = ТекСтрока.Коэффициент; 				  
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕстьРасхождения.Номенклатура КАК Номенклатура,
	               |	ЕстьРасхождения.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТ_ЕстьРасхождения
	               |ИЗ
	               |	&ЕстьРасхождения КАК ЕстьРасхождения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЕстьРасхождения.Номенклатура КАК Номенклатура,
	               |	ВТ_ЕстьРасхождения.Номенклатура КАК Коллекция,
	               |	ВТ_ЕстьРасхождения.Номенклатура.Родитель.Родитель.Родитель КАК Брэнд,
	               |	ВТ_ЕстьРасхождения.Количество КАК Количество
	               |ИЗ
	               |	ВТ_ЕстьРасхождения КАК ВТ_ЕстьРасхождения";
	
	Запрос.УстановитьПараметр("ЕстьРасхождения", ЕстьРасхождения);
	
	Если КоллекцияЭтоГруппа Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура КАК Коллекция", "Номенклатура.Родитель.Родитель КАК Коллекция");
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл    
		
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура", Выборка.Номенклатура);
		
		ПоискСтроки = СтарыйЗНБ.Товары.НайтиСтроки(Отбор); 
		
		Если ПоискСтроки.Количество() > 0 Тогда
			
			ТекСтрока = ПоискСтроки[0];
			
			НоваяСтрЗНБ = НовЗНБ.Товары.Добавить(); 				  				  
			НоваяСтрЗНБ.Номенклатура = Выборка.Номенклатура;
			
			НовСтрДляПН = ТзДляПН.Добавить();     
			
			НовСтрДляПН.Брэнд = Выборка.Брэнд;
			НовСтрДляПН.Коллекция = Выборка.Коллекция;
			НовСтрДляПН.Количество = Выборка.Количество;
			
			НоваяСтрЗНБ.Количество = Выборка.Количество; 
			
			Если ТекСтрока.КоличествоДляНаборов > 0 Тогда
				
				НоваяСтрЗНБ.КоличествоДляНаборов = Выборка.Количество; 
				НовСтрДляПН.КоличествоДляНаборов = Выборка.Количество;
				
			КонецЕсли;
			
			НоваяСтрЗНБ.ТребуетсяМаркировка = ТекСтрока.ТребуетсяМаркировка;
			НоваяСТрЗНБ.Единица = ТекСтрока.Единица;
			НоваяСТрЗНБ.Коэффициент = ТекСтрока.Коэффициент; 				  
			
		КонецЕсли;
		
	КонецЦикла; 
	// Кельманов А.В. - Проблема 0000000093 + Проблема 0000000099 - 2026.07.07 }
	
	Попытка 
		
		НовЗНБ.Записать(РежимЗаписиДокумента.Проведение); 
		
	Исключение      
		
		// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
		ТекстОповещения = "Не удалось записать новый документ ЗНБ: " + ОписаниеОшибки();
		// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
		
		ОтменитьТранзакцию(); 
		Возврат Ложь;
		
	КонецПопытки;
	
	
	//2. из Старого ЗНБ удалим НЕ НАБРАННОЕ   
	
	для Каждого стрН из ЕстьРасхождения Цикл
		
		НужноУменьшить = СтрН.Количество;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура",СтрН.Номенклатура);
		ПоискСтроки = ЗНБ.Товары.НайтиСтроки(Отбор);    
		
		Если ПоискСтроки.Количество() > 0 Тогда
			
			Для каждого НайдСтр из ПоискСтроки Цикл  
				
				Если НайдСТр.Количество<= НужноУменьшить Тогда
					
					НужноУменьшить=НужноУменьшить - НайдСТр.Количество;
					ЗНБ.Товары.Удалить(НайдСтр);
					
				Иначе  
					
					НайдСТр.Количество=НайдСТр.Количество-НужноУменьшить;
					НужноУменьшить=0;   
					
				КонецЕсли;					  
				
				Если НужноУменьшить=0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;  
	
	ЗНБ.ЧастичноСобран         = Истина;
	ЗНБ.СостояниеНакладной     = Перечисления.СостоянияНакладной.ОжиданиеПаллетирования; 
	ЗНБ.ОтправленНаТСД         = Истина;	
	ЗНБ.ЗагруженИзТСД          = Истина;		  
	
	Попытка        
		
		ЗНБ.Записать(РежимЗаписиДокумента.Проведение); 
		
	Исключение  
		
		// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
		ТекстОповещения = "Не удалось записать старый документ ЗНБ: " + ОписаниеОшибки();
		// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
		
		ОтменитьТранзакцию(); 
		Возврат Ложь;
		
	КонецПопытки;     
	
	//сверка по колиеству двух ЗНБ (страго и нового)
	
	Если БылоКоличество = (НовЗНБ.Товары.Итог("Количество") + ЗНБ.Товары.Итог("Количество")) Тогда  
		
		// Кельманов А.В. - Проблема 0000000093 + Проблема 0000000099 - 2026.07.07 {
		// !!Получаем план набора выше!!
		////3 изменяем план набора строки
		//ОбДокОсн =ЗНБПланНабора.ПолучитьОбъект();
		// Кельманов А.В. - Проблема 0000000093 + Проблема 0000000099 - 2026.07.07 }
		
		МассСтрокПН = ОбДокОсн.тБрэндов.НайтиСтроки(новый Структура("НомерЧасти", ЗНБ.НомерЧасти)); 		  
		
		Для каждого СтрМасс из МассСтрокПН цикл   				  
			
			Отбор = Новый Структура();
			Отбор.Вставить("Брэнд", СтрМасс.Брэнд);
			Отбор.Вставить("Коллекция", СтрМасс.Коллекция);
			ПоискСтрокиБр = ТзДляПН.НайтиСтроки(Отбор);  
			
			Если ПоискСтрокиБр.Количество() > 0 Тогда   
				
				НужнаяСтрокаПН = ПоискстрокиБР[0];  				  
				
				НовСтрДокОсн                  = ОбДокОсн.тБрэндов.Добавить();
				
				ЗаполнитьЗначенияСвойств(НовСтрДокОсн,СтрМасс); 
				
				//уменьшим /разделим числовые значения
				
				СтрМасс.Количество      = СтрМасс.Количество - НужнаяСтрокаПН.Количество;
				НовСтрДокОсн.Количество =  НужнаяСтрокаПН.Количество; 
				
				СтрМасс.КоличествоШтук      = СтрМасс.КоличествоШтук - НужнаяСтрокаПН.Количество;
				НовСтрДокОсн.КоличествоШтук =  НужнаяСтрокаПН.Количество;  
				
				СтрМасс.КоличествоДляНаборов      = СтрМасс.КоличествоДляНаборов - НужнаяСтрокаПН.КоличествоДляНаборов;
				НовСтрДокОсн.КоличествоДляНаборов =  НужнаяСтрокаПН.КоличествоДляНаборов;
				
				СтрМасс.КоличествоСтрок       = СтрМасс.КоличествоСтрок - НовЗНБ.Товары.Количество();
				НовСтрДокОсн.КоличествоСтрок  = НовЗНБ.Товары.Количество();
				
				//уменьшим /разделим числовые значения
				
				НовСтрДокОсн.НомерЧасти       = НомерНовойЧасти;
				НовСтрДокОсн.Состояние        = Перечисления.СостоянияНакладной.СформированыЗаданияНабора; 
				
				//обнулим физ.лица и время работ
				
				НовСтрДокОсн.Наборщик         = Справочники.ФизическиеЛица.ПустаяСсылка();
				НовСтрДокОсн.Сканировщик      = Справочники.ФизическиеЛица.ПустаяСсылка();
				НовСтрДокОсн.ДопОбработчик    = Справочники.ФизическиеЛица.ПустаяСсылка();
				НовСтрДокОсн.Паллетировщик    = Справочники.ФизическиеЛица.ПустаяСсылка();
				
				НовСтрДокОсн.НачалоНабора      = Дата(1,1,1);
				НовСтрДокОсн.ОкончаниеНабора   = Дата(1,1,1);
				НовСтрДокОсн.НаборЗакончен     = Ложь;
				
				НовСтрДокОсн.НачалоСканировки      = Дата(1,1,1);
				НовСтрДокОсн.ОкончаниеСканировки   = Дата(1,1,1);
				НовСтрДокОсн.СканировкаЗакончена   = Ложь;     
				
				НовСтрДокОсн.НачалоДопОбработки    = Дата(1,1,1);
				НовСтрДокОсн.ОкончаниеДопОбработки = Дата(1,1,1);
				НовСтрДокОсн.ДопОбработкаЗакончена = Ложь;   
				
				НовСтрДокОсн.НачалоПаллетирования      = Дата(1,1,1);
				НовСтрДокОсн.ОкончаниеПаллетирования   = Дата(1,1,1);
				НовСтрДокОсн.ПаллетированиеЗакончено  = Ложь;  
				
			КонецЕсли;
			
			СтрМасс.Состояние= Перечисления.СостоянияНакладной.ОжиданиеПаллетирования;
			
		КонецЦикла; 
		
		//по аналогии заполнения документа заполним наборщиков
		ТЗ_Наборщики = Документы.ПланНабора.ЗаполнитьСлужебногоНаборщикаFBS(ОбДокОсн.тБрэндов.Выгрузить());
		Для Каждого Стр ИЗ ТЗ_Наборщики Цикл
			НайденныеСтроки = ОбДокОсн.тБрэндов.НайтиСтроки(Новый Структура("Брэнд, Коллекция", Стр.Брэнд, Стр.Коллекция));
			Для Каждого НСтр ИЗ НайденныеСтроки Цикл
				Если НЕ ЗначениеЗаполнено(НСтр.Наборщик) Тогда
					НСтр.Наборщик = Стр.СлужебныйНаборщик;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Попытка        

			ОбДокОсн.Записать(РежимЗаписиДокумента.Проведение);

		Исключение  
			
			// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
			ТекстОповещения = "Не удалось записать план набора: " + ОписаниеОшибки();
			// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
			
			ОтменитьТранзакцию(); 
			Возврат ложь;
			
		КонецПопытки;

		ЗафиксироватьТранзакцию();   
		
		Возврат Истина;
		
	Иначе	  
		
		// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 {
		ТекстОповещения = "Не совпало количество товара в ЗНБ до разделения с суммарным количеством старого и нового ЗНБ после разделения";
		// Кельманов А.В. - ПРО-0000000110 - 2026.06.18 }
		
		ОтменитьТранзакцию(); 
		
	КОнецЕсли;
	
	Если ТранзакцияАктивна() Тогда
		ОтменитьТранзакцию(); 
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Процедура ЗаданиеПоЗанятостиСотрудниковСклада(ТаблицаПараметров=Неопределено) Экспорт
	
	//	УЧЕТ РАБОЧЕГО ВРЕМЕНИ СОТРУДНИКАМИ СКЛАДА
	//ID-27767
	
	//ТИМОФЕЕВ Ю.А. продолжении следует - в разработке	
	
КонецПроцедуры
